MODULES_KNOWLEDGE = {
    "Python введение": {
        1: [
            "основы синтаксиса и работу с простейшими командами print() и input()",
        ],
        2: [
            "",
        ],
        3: [
            "",
        ],
        4: [
            "",
        ],
        5: [
            "",
        ],
        6: [
            "",
        ],
        7: [
            "",
        ],
        8: [
            "",
        ],
        9: [
            "",
        ],
        10: [
            "",
        ],
        11: [
            "",
        ],
        12: [
            "",
        ],
        13: [
            "",
        ],
    },
    "Основы Python": {
        1: [
            "основы синтаксиса и работу с простейшими командами print() и sleep(), а также работу с ANSI кодами",
        ],
        2: [
            "работу с библиотеками num2words и transliterate, позволяющими транслитерировать тексты с разных языков и переводить числа в слова",
        ],
        3: [
            "библиотеку smtplib, позволяющую создавать почтовые рассылки",
        ],
        4: [
            "важнейшую библиотеку для работы с изображениями Pillow",
        ],
        5: [
            "создание простейших ботов в Telegram",
        ],
        6: [
            "работу с библиотекой Faker, позволяющей создавать фейковые данные, а также обработку и заполнение шаблонов"
        ],
        7: [
            "функции и работу с библиотекой urwid, позволяющей создавать интерфейсы в командной строке",
        ],
        8: [
            "работу с .json файлами, координатами  и создание простого сайта с картами",
        ],
    },
    "Командная строка": {
        1: [
            "основы работы с командной строкой, запуск программ и использование их аргументов",
        ],
        2: [
            "навигациию по файловой системе и чтение текстовых файлов",
        ],
        3: [
            "поиск файлов на сервере, редактирование текстовых документов и работу с переменными окружения",
        ],
        4: [
            "работу с правами доступа к файлам и папкам, а также новые текстовые редакторы",
        ],
        5: [
            "работу с логами программ, фильтрацию данных, а также создание и удаление файлов",
        ],
    },
    "Git и Github": {
        1: [
            "основы работы с программой Github Desktop",
        ],
        2: [
            "работу коммитами других пользователей и редактирование файлов на Github",
        ],
        3: [
            "",
        ],
        4: [
            "",
        ],
        5: [
            "",
        ],
    },
    "API веб-сервисов": {
        1: [
            "",
        ],
        2: [
            "",
        ],
        3: [
            "",
        ],
        4: [
            "",
        ],
        5: [
            "",
        ],
        6: [
            "",
        ],
    }
}
