MODULES_KNOWLEDGE = {
    "Python введение": {
        1: [
            "типы данных и их назначения, основы синтаксиса и работу с простейшими командами print() и input()",
        ],
        2: [
            "",
        ],
        3: [
            "",
        ],
        4: [
            "",
        ],
        5: [
            "генерацию случайных чисел, условные конструкции, цикл for",
        ],
        6: [
            "",
        ],
        7: [
            "",
        ],
        8: [
            "",
        ],
        9: [
            "шифр Цезаря, методы строк и как ими пользоваться",
        ],
        10: [
            "",
        ],
        11: [
            "основы обработки изображений программами с помощью библиотеки Pillow",
        ],
        12: [
            "",
        ],
        13: [
            "библиотеки для считывания текста из pdf файлов и превращения их в аудио файлы",
        ],
    },
    "Основы Python": {
        1: [
            "основы синтаксиса и работу с простейшими командами print() и sleep(), а также работу с ANSI кодами",
        ],
        2: [
            "работу с библиотеками num2words и transliterate, позволяющими транслитерировать тексты с разных языков и переводить числа в слова",
        ],
        3: [
            "библиотеку smtplib, позволяющую создавать почтовые рассылки",
        ],
        4: [
            "важнейшую библиотеку для работы с изображениями Pillow",
        ],
        5: [
            "создание простейших ботов в Telegram",
        ],
        6: [
            "работу с библиотекой Faker, позволяющей создавать фейковые данные, а также обработку и заполнение шаблонов"
        ],
        7: [
            "функции и работу с библиотекой urwid, позволяющей создавать интерфейсы в командной строке",
        ],
        8: [
            "работу с .json файлами, координатами  и создание простого сайта с картами",
        ],
    },
    "Командная строка": {
        1: [
            "основы работы с командной строкой, запуск программ и использование их аргументов",
        ],
        2: [
            "навигациию по файловой системе и чтение текстовых файлов",
        ],
        3: [
            "поиск файлов на сервере, редактирование текстовых документов и работу с переменными окружения",
        ],
        4: [
            "работу с правами доступа к файлам и папкам, а также новые текстовые редакторы",
        ],
        5: [
            "работу с логами программ, фильтрацию данных, а также создание и удаление файлов",
        ],
    },
    "Git и GitHub": {
        1: [
            "основы работы с программой Github Desktop",
        ],
        2: [
            "работу c коммитами других пользователей и редактирование файлов на Github",
        ],
        3: [
            "оформление документации и лицензии проекта, а также его публикацию",
        ],
        4: [
            "оформление документации и статей с помощью языка разметки markdown",
        ],
        5: [
            "работу с ветками проекта, их создание, изменение и слияние",
        ],
    },
    "API веб-сервисов": {
        1: [
            "библиотеку request, использование GET запросов для получения данных с сайтов",
        ],
        2: [
            "работу с сервисом Bitly, позволяющим создавать короткие ссылки и считать клики по ним",
        ],
        3: [
            "основы оформления собственного проекта для дальнейшего размещения его на сайте Github",
        ],
        4: [
            "работу с сервисами по предоставлению фотографий космоса и процесс создания бота для публикации фотографий в телеграм-канал",
        ],
        5: [
            "процесс получения и анализа данных с сайтов HeadHunter и SuperJob для их дальнейшей обработки",
        ],
        6: [
            "работу с API Вконтакте, а также публикацию записей на стене группы",
        ],
    },
    "Мобильная разработка в Thunkable": {
        1: [
            "основы работы в Thunkable, его интерфейс и базовые возможности",
        ],
        2: [
            "создание анимации и оформление элементов приложения",
        ],
        3: [
            "работу с таблицами, их создание заполнение и использование, а также работу со звуком: распознавание и воспроизведение речи",
        ],
        4: [
            "продвинутую работу с переменными, условиями и дополнительными экранами, а также получение данных из сторонних источников",
        ],
        5: [
            "функции, их возможности и области применения, а также принципы работы калькулятора",
        ],
        6: [
            "работу с канвасом и процесс создания мобильной игры",
        ],
    },
    "WEB разработка (HTML / CSS)": {
        1: [
            "основные теги HTML-страниц и простейшие CSS-стили",
        ],
        2: [
            "работу с готовыми шаблонами и макетами сайтов, панель разработчика в браузере",
        ],
		3: [
            "работу с классами и псевдоклассами, а также изучит принципы добавления изображения на страницу и позиционирование объектов",
        ],
        4: [
            "работу со списками на сайтах, а также создание сайта-ежедневника",
        ],
        5: [
            "работу с многостраничными сайтами, новые HTML-теги и CSS-стили",
        ],
        6: [
            "оформление и расположение таблиц на сайтах",
        ],
        7: [
            "медиа-запросы и создание страницы сайта под различные разрешения экранов",
        ],
        8: [
            "работу с сетками элементов и более сложными селекторами стилей",
        ],
        9: [
            "",
        ],
    },
    "Вёрстка для питониста": {
        1: [
            "основы шаблонизации сайтов, запуск сервера на котором этот сайт расположен. ",
        ],
        2: [
            "основной фреймворк для создания серверной части сайтов на языке python - Django, продвинутую шаблонизацию сайтов",
        ],
        3: [
            "получение и обработку информации с сайтов(парсинг) с помощью библиотеки beautifullsoup",
        ],
        4: [
            "продвинутую работу с данными с сайтов, их обработку и сохранение ",
        ],
        5: [
            "автоматическое создание и наполнение страниц сайта с помощью программы, а также создание мини-сайта на github-pages",
        ],
    },
    "Знакомство с Django: ORM": {
        1: [
            "основы взаимодействия с базами данных через фреймворк Django",
        ],
        2: [
            "локальное использование фреймворка Django и настройку подключения к базе данных",
        ],
        3: [
            "получение и изменение данных из БД, вызов функций и команд через Django shell",
        ],
        4: [
            "взаимодействие Django с HTML-страницами, создание моделей описывающих базу данных",
        ],
        5: [
            "панель администратора Django, фильтрацию и сортировку информации из базы данных",
        ],
        6: [
            "оптимизацию сайтов при их взаимодействии с базами данных",
        ],
    },
	"2D-игры на Construct 3": {
		1: [
			"создание первой игры. В ходе создания игры изучает основные интрументы, способы создания и редактирование объектов."
		],
		2: [
            ""
        ],
		3: [
            ""
        ],
		4: [
            ""
        ],
		5: [
            ""
        ]
		
	},
	"Основы JavaScript":{
		1: [
            ""
        ],
		2: [
            ""
        ],
		3: [
            ""
        ],
		4: [
            ""
        ],
		5: [
            ""
        ],
		6: [
            ""
        ],
		7: [
            ""
        ],
		8: [
            ""
        ]
	
	},
	"Введение JavaScript":{
		1: [
            ""
        ],
		2: [
            ""
        ],
		3: [
            ""
        ],
		4: [
            ""
        ],
		5: [
            ""
        ],
		6: [
            ""
        ],
		7: [
            ""
        ],
		8: [
            ""
        ],
		9: [
            ""
        ],
		10: [
            ""
        ],
		11: [
            ""
        ],
		12: [
            ""
        ],
		13: [
            ""
        ],
	}
}
